BOT_TOKEN = "5582509664:AAFBNVBKBTWw1UaEB7y1FeNc_WefgPTIJuM"
SERVICE_ACCOUNT_FILENAME = "deep-chimera-369808-c3c03db23992.json"

months = {"01": "января", "02": "февраля", "03": "марта",
          "04": "апреля", "05": "мая", "06": "июня",
          "07": "июля", "08": "августа", "09": "сентября",
          "10": "октября", "11": "ноября", "12": "декабря"
          }

start_message = f"""Привет, %s! Я бот для записи на стирку👕
Чтобы начать работу напиши Фамилию и Имя👇"""
occupy_message = "%s, вы успешно записаны на стирку %s в %s!\n[проверить запись](https://docs.google.com/spreadsheets/d/1zzDqgjeGJi-727oqofMmWJekHm_8TveNYZvP-ju7gJo)"
check_occupied_msg = "[Проверить свободные места](https://docs.google.com/spreadsheets/d/1zzDqgjeGJi-727oqofMmWJekHm_8TveNYZvP-ju7gJo)"
check_free_msg = "[Проверить отмену записи](https://docs.google.com/spreadsheets/d/1zzDqgjeGJi-727oqofMmWJekHm_8TveNYZvP-ju7gJo)"

main_kb = ["Записаться на стирку👕", "Отменить запись❌"]
machines_kb = {"Стиралка №1": "A2-B19", "Стиралка №3": "D2-E19", "Стиралка №4": "G2-H19", "Сушилка №2": "J2-K19"}

machines_cols = {"Стиралка №1": "B", "Стиралка №3": "E", "Стиралка №4": "H", "Сушилка №2": "K"}
times_rows = {"6-00": "2", "7-00": "3", "8-00": "4", "9-00": "5", "10-00": "6", "11-00": "7", "12-00": "8",
              "13-00": "9", "14-00": "10", "15-00": "11", "16-00": "12", "17-00": "13", "18-00": "14",
              "19-00": "15", "20-00": "16", "21-00": "17", "22-00": "18", "23-00": "19"}
cancel_rows = {2: "6:00", 3: "7:00", 4: "8:00", 5: "9:00", 6: "10:00", 7: "11:00", 8: "12:00",
               9: "13:00", 10: "14:00", 11: "15:00", 12: "16:00", 13: "17:00", 14: "18:00",
               15: "19:00", 16: "20:00", 17: "21:00", 18: "22:00", 19: "23:00"}
cancel_cols = {2: "Стиралка №1", 5: "Стиралка №3", 8: "Стиралка №4", 11: "Сушилка №2"}

def get_month(number: str) -> str:
    return months[number]